[Killed] BlockStatement
aplicacion/cliente/comando/registrar-cliente.manejador.ts:10:69
 export class ManejadorRegistrarCliente {
     constructor(private _servicioRegistrarCliente: ServicioRegistrarCliente) {}
 
-    async ejecutar(comandoRegistrarCliente: ComandoRegistrarCliente){
-        await this._servicioRegistrarCliente.ejecutar(
-            new Cliente(
-                comandoRegistrarCliente.cedula,
-                comandoRegistrarCliente.nombre,
-                comandoRegistrarCliente.apellidos,
-                comandoRegistrarCliente.telefono,
-                comandoRegistrarCliente.email
-            )
-        );
-    }
+    async ejecutar(comandoRegistrarCliente: ComandoRegistrarCliente){}
 }
killedBy: Pruebas al controlador de clientes deberia fallar si la cedula es menor de 6 caracteres o mayor a 10
statusReason: Error: expected 400 "Bad Request", got 201 "Created"
