[Killed] BlockStatement
aplicacion/cliente/comando/actualizar-cliente.manejador.ts:10:89
 export class ManejadorActualizarCliente {
     constructor(private _servicioActualizarCliente: ServicioActualizarCliente) {}
 
-    async ejecutar(comandoRegistrarCliente: ComandoRegistrarCliente, idCliente: number) {
-        await this._servicioActualizarCliente.ejecutar(
-            new Cliente(
-                comandoRegistrarCliente.cedula,
-                comandoRegistrarCliente.nombre,
-                comandoRegistrarCliente.apellidos,
-                comandoRegistrarCliente.telefono,
-                comandoRegistrarCliente.email
-            ),
-            idCliente
-        )
-    }
+    async ejecutar(comandoRegistrarCliente: ComandoRegistrarCliente, idCliente: number) {}
 }
killedBy: Pruebas al controlador de clientes deberia fallar al intentar actualizar un cliente que no existe
statusReason: Error: expected 400 "Bad Request", got 200 "OK"
