[Survived] BlockStatement
aplicacion/cliente/consulta/consultar-existencia-cliente.manejador.ts:8:55
 export class ManejadorConsultarExistenciaCliente {
     constructor(private _daoCliente: DaoCliente) {}
 
-    async ejecutar(_cedula: string): Promise<Boolean> {
-        return this._daoCliente.existeCliente(_cedula);
-    }
+    async ejecutar(_cedula: string): Promise<Boolean> {}
 }
