[Killed] BlockStatement
aplicacion/cliente/consulta/listar-clientes.manejador.ts:9:45
 export class ManejadorListarCliente {
     constructor(private _daocliente: DaoCliente) {}
 
-    async ejecutar(): Promise<ClienteDto[]> {
-        return this._daocliente.listar();
-    }
+    async ejecutar(): Promise<ClienteDto[]> {}
 }
killedBy: Pruebas al controlador de clientes deberia listar los clientes registrados
statusReason: Error: expected [
  {
    id: 1,
    cedula: '1234567',
    nombre: 'Juanito',
    apellidos: 'Alvarez',
    telefono: '3215548787',
    email: 'juan.1@gmail.com'
