[Killed] BlockStatement
aplicacion/reserva/comando/eliminar-reserva.manejador.ts:9:31
 
     constructor(private _servicioEliminarReserva: ServicioEliminarReserva) {}
 
-    async ejecutar(id: number){
-        await this._servicioEliminarReserva.ejecutar(id);
-    }
+    async ejecutar(id: number){}
 }
killedBy: Pruebas al controlador de reservas deberia fallar al eliminar una reserva que no existe
statusReason: Error: expected 400 "Bad Request", got 200 "OK"
