[Killed] BlockStatement
aplicacion/reserva/comando/registrar-reserva.manejador.ts:11:84
 export class ManejadorRegistrarReserva {
     constructor(private _servicioRegistrarReserva: ServicioRegistrarReserva) {}
     
-    async ejecutar(comandoRegistrarReserva: ComandoRegistrarReserva, horas: number){
-        await this._servicioRegistrarReserva.ejecutar(
-            new Reserva(
-                new Date(comandoRegistrarReserva.fechaInicio),
-                new Date(),
-                new Cliente(
-                    comandoRegistrarReserva.cliente.cedula,
-                    comandoRegistrarReserva.cliente.nombre,
-                    comandoRegistrarReserva.cliente.apellidos,
-                    comandoRegistrarReserva.cliente.telefono,
-                    comandoRegistrarReserva.cliente.email
-                )
-            ), horas
-        );
-    }
+    async ejecutar(comandoRegistrarReserva: ComandoRegistrarReserva, horas: number){}
 }
killedBy: Pruebas al controlador de reservas debería fallar al registar una reseva ya existente
statusReason: Error: expected 400 "Bad Request", got 201 "Created"
