[Survived] BlockStatement
aplicacion/reserva/consulta/consultar-existencia-reserva-por-id.manejador.ts:8:50
 export class ManejadorConsultarExistenciaPorId {
     constructor(private _daoReserva: DaoReserva) {}
 
-    async ejecutar(id: number): Promise<Boolean> {
-        return this._daoReserva.existeReservaPorId(id);
-    }
+    async ejecutar(id: number): Promise<Boolean> {}
 }
