[Survived] BlockStatement
aplicacion/reserva/consulta/consultar-existencia-reservas.manejador.ts:8:75
 export class ManejadorConsultarExistenciaReserva {
     constructor(private _daoReserva: DaoReserva) {}
 
-    async ejecutar(_fechaInicio: Date, _fechaFin: Date): Promise<Boolean> {
-        return this._daoReserva.existeReserva(_fechaInicio, _fechaFin);
-    }
+    async ejecutar(_fechaInicio: Date, _fechaFin: Date): Promise<Boolean> {}
 }
