[Killed] BlockStatement
aplicacion/usuario/comando/registrar-usuario.manejador.ts:10:68
 export class ManejadorRegistrarUsuario {
   constructor(private _servicioRegistrarUsuario: ServicioRegistrarUsuario) {}
 
-  async ejecutar(comandoRegistrarUsuario: ComandoRegistrarUsuario) {
-    await this._servicioRegistrarUsuario.ejecutar(
-      new Usuario(
-        comandoRegistrarUsuario.nombre,
-        comandoRegistrarUsuario.clave,
-        comandoRegistrarUsuario.fechaCreacion,
-      ),
-    );
-  }
+  async ejecutar(comandoRegistrarUsuario: ComandoRegistrarUsuario) {}
 }
 
killedBy: Pruebas al controlador de usuarios debería fallar al registar un usuario clave muy corta
statusReason: Error: expected 400 "Bad Request", got 201 "Created"
