[Killed] BlockStatement
aplicacion/reserva/consulta/listar-reservas.manejador.ts:9:45
 export class ManejadorListarReserva {
     constructor(private _daoReserva: DaoReserva) {}
 
-    async ejecutar(): Promise<ReservaDto[]> {
-        return this._daoReserva.listar();
-    }
+    async ejecutar(): Promise<ReservaDto[]> {}
 }
killedBy: Pruebas al controlador de reservas debería listar las reservas registradas
statusReason: Error: expected [
  {
    fechaInicio: '2023-07-12T13:51:18.283Z',
    fechaFin: '2023-07-12T13:51:18.283Z',
    cliente: {
      cedula: '1234567',
      nombre: 'Juan',
      apellidos: 'Perez',
