[Killed] BlockStatement
aplicacion/usuario/consulta/listar-usuarios.manejador.ts:10:43
 export class ManejadorListarUsuario {
   constructor(private _daoUsuario: DaoUsuario) {}
 
-  async ejecutar(): Promise<UsuarioDto[]> {
-    return this._daoUsuario.listar();
-  }
+  async ejecutar(): Promise<UsuarioDto[]> {}
 }
 
killedBy: Pruebas al controlador de usuarios debería listar los usuarios registrados
statusReason: Error: expected [
  { nombre: 'Lorem ipsum', fechaCreacion: '2023-07-12T13:51:23.149Z' }
] response body, got {}
