[Killed] BlockStatement
dominio/cliente/modelo/cliente.ts:12:101
     readonly #telefono: string;
     readonly #email: string;
 
-    constructor(cedula: string, nombre: string, apellidos: string, telefono: string, email: string) {
-        this.#cedula = this.validarTamanoCedula(cedula);
-        this.#nombre = nombre;
-        this.#apellidos = apellidos;
-        this.#telefono = telefono;
-        this.#email = email;
-    }
+    constructor(cedula: string, nombre: string, apellidos: string, telefono: string, email: string) {}
 
     private validarTamanoCedula(cedula: string): string{
killedBy: Pruebas al controlador de clientes deberia fallar si la cedula es menor de 6 caracteres o mayor a 10
statusReason: Error: expected 400 "Bad Request", got 201 "Created"

[Killed] BlockStatement
dominio/cliente/modelo/cliente.ts:20:56
         this.#email = email;
     }
 
-    private validarTamanoCedula(cedula: string): string{
-        if (cedula.length <= NUMERO_MINIMO_CARACTERES_CEDULA || cedula.length >= Numero_MAXIMO_CARACTERES_CEDULA){
-            throw new ErrorLongitudInvalida(
-                'El tamaño de la cedula debe tener entre 6 y 10 caracteres',
-            )
-        }
-        return cedula;
-    }
+    private validarTamanoCedula(cedula: string): string{}
 
     get cedula(): string{
killedBy: Pruebas al controlador de clientes deberia fallar si la cedula es menor de 6 caracteres o mayor a 10
statusReason: Error: expected 400 "Bad Request", got 201 "Created"

[Killed] EqualityOperator
dominio/cliente/modelo/cliente.ts:21:13
     }
 
     private validarTamanoCedula(cedula: string): string{
-        if (cedula.length <= NUMERO_MINIMO_CARACTERES_CEDULA || cedula.length >= Numero_MAXIMO_CARACTERES_CEDULA){
+        if (cedula.length < NUMERO_MINIMO_CARACTERES_CEDULA || cedula.length >= Numero_MAXIMO_CARACTERES_CEDULA){
             throw new ErrorLongitudInvalida(
                 'El tamaño de la cedula debe tener entre 6 y 10 caracteres',
killedBy: Pruebas al controlador de clientes deberia fallar si la cedula es menor de 6 caracteres o mayor a 10
statusReason: Error: expected 400 "Bad Request", got 201 "Created"

[Killed] BlockStatement
dominio/cliente/modelo/cliente.ts:21:114
     }
 
     private validarTamanoCedula(cedula: string): string{
-        if (cedula.length <= NUMERO_MINIMO_CARACTERES_CEDULA || cedula.length >= Numero_MAXIMO_CARACTERES_CEDULA){
-            throw new ErrorLongitudInvalida(
-                'El tamaño de la cedula debe tener entre 6 y 10 caracteres',
-            )
-        }
+        if (cedula.length <= NUMERO_MINIMO_CARACTERES_CEDULA || cedula.length >= Numero_MAXIMO_CARACTERES_CEDULA){}
         return cedula;
     }
killedBy: Pruebas al controlador de clientes deberia fallar si la cedula es menor de 6 caracteres o mayor a 10
statusReason: Error: expected 400 "Bad Request", got 201 "Created"

[Killed] BlockStatement
dominio/cliente/modelo/cliente.ts:29:25
         return cedula;
     }
 
-    get cedula(): string{
-        return this.#cedula;
-    }
+    get cedula(): string{}
 
     get nombre(): string{
killedBy: Cliente Cliente con cedula mayor o igual a 6 debería y menor o igual a 10 deberia crear bien
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "1234567"
Received: undefined

[Killed] BlockStatement
dominio/cliente/modelo/cliente.ts:33:25
         return this.#cedula;
     }
 
-    get nombre(): string{
-        return this.#nombre;
-    }
+    get nombre(): string{}
 
     get apellidos(): string{
killedBy: Cliente Cliente con cedula mayor o igual a 6 debería y menor o igual a 10 deberia crear bien
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "Juan"
Received: undefined

[Killed] BlockStatement
dominio/cliente/modelo/cliente.ts:37:28
         return this.#nombre;
     }
 
-    get apellidos(): string{
-        return this.#apellidos;
-    }
+    get apellidos(): string{}
 
     get telefono(): string{
killedBy: Cliente Cliente con cedula mayor o igual a 6 debería y menor o igual a 10 deberia crear bien
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "Perez"
Received: undefined

[Killed] BlockStatement
dominio/cliente/modelo/cliente.ts:41:27
         return this.#apellidos;
     }
 
-    get telefono(): string{
-        return this.#telefono;
-    }
+    get telefono(): string{}
 
     get email(): string{
killedBy: Cliente Cliente con cedula mayor o igual a 6 debería y menor o igual a 10 deberia crear bien
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "3205514645"
Received: undefined

[Killed] BlockStatement
dominio/cliente/modelo/cliente.ts:45:24
         return this.#telefono;
     }
 
-    get email(): string{
-        return this.#email;
-    }
+    get email(): string{}
 }
killedBy: Cliente Cliente con cedula mayor o igual a 6 debería y menor o igual a 10 deberia crear bien
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "juan.10@gmail.com"
Received: undefined
