[Killed] BlockStatement
dominio/cliente/servicio/servicio-actualizar-cliente.ts:10:56
     constructor(private _repositorioCliente: RepositorioCliente, 
                 private _daoCliente: DaoCliente) {}
 
-    async ejecutar(cliente: Cliente, idCliente: number){
-        await this.validarExistenciaCliente(cliente.cedula);
-        await this._repositorioCliente.actualizar(cliente, idCliente);
-    }
+    async ejecutar(cliente: Cliente, idCliente: number){}
 
     private async validarExistenciaCliente(cedula: string){
killedBy: Pruebas al controlador de clientes deberia fallar al intentar actualizar un cliente que no existe
statusReason: Error: expected 400 "Bad Request", got 200 "OK"

[Killed] BlockStatement
dominio/cliente/servicio/servicio-actualizar-cliente.ts:15:59
         await this._repositorioCliente.actualizar(cliente, idCliente);
     }
 
-    private async validarExistenciaCliente(cedula: string){
-        const existe = await this._daoCliente.existeCliente(cedula);
-        if (!existe) {
-            throw new ErrorDeNegocio(
-                'No se encuentra registrado el cliente con dicha cedula'
-            )
-        }
-    }
+    private async validarExistenciaCliente(cedula: string){}
 }
killedBy: Pruebas al controlador de clientes deberia fallar al intentar actualizar un cliente que no existe
statusReason: Error: expected 400 "Bad Request", got 200 "OK"

[Killed] BooleanLiteral
dominio/cliente/servicio/servicio-actualizar-cliente.ts:17:13
 
     private async validarExistenciaCliente(cedula: string){
         const existe = await this._daoCliente.existeCliente(cedula);
-        if (!existe) {
+        if (existe) {
             throw new ErrorDeNegocio(
                 'No se encuentra registrado el cliente con dicha cedula'
killedBy: Pruebas al controlador de clientes deberia fallar al intentar actualizar un cliente que no existe
statusReason: Error: expected 400 "Bad Request", got 200 "OK"

[Killed] BlockStatement
dominio/cliente/servicio/servicio-actualizar-cliente.ts:17:22
 
     private async validarExistenciaCliente(cedula: string){
         const existe = await this._daoCliente.existeCliente(cedula);
-        if (!existe) {
-            throw new ErrorDeNegocio(
-                'No se encuentra registrado el cliente con dicha cedula'
-            )
-        }
+        if (!existe) {}
     }
 }
killedBy: Pruebas al controlador de clientes deberia fallar al intentar actualizar un cliente que no existe
statusReason: Error: expected 400 "Bad Request", got 200 "OK"
