[Killed] BlockStatement
dominio/cliente/servicio/servicio-registrar-cliente.ts:7:37
 export class ServicioRegistrarCliente {
     constructor(private _repositorioCliente: RepositorioCliente) {}
 
-    async ejecutar(cliente: Cliente){
-        await this._repositorioCliente.guardar(cliente);
-    }
+    async ejecutar(cliente: Cliente){}
 }
killedBy: ServicioRegistrarCliente si la cedula no existe guarda el cliente en el repositorio
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0
