[Killed] BlockStatement
src/dominio/errores/error-de-negocio.ts:2:48
 export class ErrorDeNegocio extends Error {
-  constructor(mensaje: string, clase?: string) {
-    super(mensaje);
-    this.name = clase || ErrorDeNegocio.name;
-  }
+  constructor(mensaje: string, clase?: string) {}
 }
 
killedBy: Pruebas al controlador de clientes deberia fallar si la cedula es menor de 6 caracteres o mayor a 10
statusReason: Error: expected 400 "Bad Request", got 500 "Internal Server Error"

[Survived] LogicalOperator
src/dominio/errores/error-de-negocio.ts:4:17
 export class ErrorDeNegocio extends Error {
   constructor(mensaje: string, clase?: string) {
     super(mensaje);
-    this.name = clase || ErrorDeNegocio.name;
+    this.name = clase && ErrorDeNegocio.name;
   }
 }

[Survived] ConditionalExpression
src/dominio/errores/error-de-negocio.ts:4:17
 export class ErrorDeNegocio extends Error {
   constructor(mensaje: string, clase?: string) {
     super(mensaje);
-    this.name = clase || ErrorDeNegocio.name;
+    this.name = false;
   }
 }
