[Survived] BlockStatement
src/dominio/errores/error-fecha-reserva.ts:4:34
 import { ErrorDeNegocio } from './error-de-negocio';
 
 export class ErrorFechaReserva extends ErrorDeNegocio {
-    constructor(mensaje: string) {
-        super(mensaje, ErrorFechaReserva.name);
-    }
+    constructor(mensaje: string) {}
 }
