[Killed] BlockStatement
src/dominio/errores/error-longitud-invalida.ts:4:32
 import { ErrorDeNegocio } from './error-de-negocio';
 
 export class ErrorLongitudInvalida extends ErrorDeNegocio {
-  constructor(mensaje: string) {
-    super(mensaje, ErrorLongitudInvalida.name);
-  }
+  constructor(mensaje: string) {}
 }
 
killedBy: Pruebas al controlador de clientes deberia fallar si la cedula es menor de 6 caracteres o mayor a 10
statusReason: Error: expected 400 "Bad Request", got 500 "Internal Server Error"
