[Survived] BlockStatement
src/dominio/errores/error-valor-requerido.ts:4:32
 import { ErrorDeNegocio } from './error-de-negocio';
 
 export class ErrorValorRequerido extends ErrorDeNegocio {
-  constructor(mensaje: string) {
-    super(mensaje, ErrorValorRequerido.name);
-  }
+  constructor(mensaje: string) {}
 }
 
