[Killed] BlockStatement
dominio/reserva/modelo/reserva.ts:9:70
     #fechaFin: Date;
     readonly #cliente: Cliente;
 
-    constructor(fechaInicio: Date, fechaFin: Date, cliente: Cliente) {
-        this.#fechaInicio = fechaInicio;
-        this.#fechaFin = fechaFin;
-        this.#cliente = cliente;
-    }
+    constructor(fechaInicio: Date, fechaFin: Date, cliente: Cliente) {}
 
     get fechaInicio(): Date {
killedBy: Reserva Reserva si todos los datos estan bien, deberia crear la reserva
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "2023-06-27T19:30:00.000Z"
Received: undefined

[Killed] BlockStatement
dominio/reserva/modelo/reserva.ts:15:29
         this.#cliente = cliente;
     }
 
-    get fechaInicio(): Date {
-        return this.#fechaInicio;
-    }
+    get fechaInicio(): Date {}
 
     get fechaFin(): Date {
killedBy: Reserva Reserva si todos los datos estan bien, deberia crear la reserva
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "2023-06-27T19:30:00.000Z"
Received: undefined

[Killed] BlockStatement
dominio/reserva/modelo/reserva.ts:19:26
         return this.#fechaInicio;
     }
 
-    get fechaFin(): Date {
-        return this.#fechaFin;
-    }
+    get fechaFin(): Date {}
 
     set fechaFin(fechaFin: Date){
killedBy: Reserva Reserva si todos los datos estan bien, deberia crear la reserva
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "2023-06-27T22:30:00.000Z"
Received: undefined

[Survived] BlockStatement
dominio/reserva/modelo/reserva.ts:23:33
         return this.#fechaFin;
     }
 
-    set fechaFin(fechaFin: Date){
-        this.#fechaFin = fechaFin;
-    }
+    set fechaFin(fechaFin: Date){}
 
     get cliente(): Cliente {

[Survived] BlockStatement
dominio/reserva/modelo/reserva.ts:27:28
         this.#fechaFin = fechaFin;
     }
 
-    get cliente(): Cliente {
-        return this.#cliente;
-    }
+    get cliente(): Cliente {}
 }
