[Killed] BlockStatement
dominio/reserva/servicio/servicio-eliminar-reserva.ts:9:32
     constructor(private _repositorioReserva: RepositorioReserva, 
         private _daoReserva: DaoReserva) {}
 
-    async ejecutar(id: number) {
-        await this.validarExistenciaReserva(id);
-        await this._repositorioReserva.eliminar(id);
-    }
+    async ejecutar(id: number) {}
 
     private async validarExistenciaReserva(id: number){
killedBy: Pruebas al controlador de reservas deberia fallar al eliminar una reserva que no existe
statusReason: Error: expected 400 "Bad Request", got 200 "OK"

[Killed] BlockStatement
dominio/reserva/servicio/servicio-eliminar-reserva.ts:14:55
         await this._repositorioReserva.eliminar(id);
     }
 
-    private async validarExistenciaReserva(id: number){
-        const existe = await this._daoReserva.existeReservaPorId(id);
-        if (!existe) {
-            throw new ErrorDeNegocio(
-                'No se encuentra la reserva registrada'
-            )
-        }
-    }
+    private async validarExistenciaReserva(id: number){}
 }
killedBy: Pruebas al controlador de reservas deberia fallar al eliminar una reserva que no existe
statusReason: Error: expected 400 "Bad Request", got 200 "OK"

[Killed] ConditionalExpression
dominio/reserva/servicio/servicio-eliminar-reserva.ts:16:13
 
     private async validarExistenciaReserva(id: number){
         const existe = await this._daoReserva.existeReservaPorId(id);
-        if (!existe) {
+        if (false) {
             throw new ErrorDeNegocio(
                 'No se encuentra la reserva registrada'
killedBy: Pruebas al controlador de reservas deberia fallar al eliminar una reserva que no existe
statusReason: Error: expected 400 "Bad Request", got 200 "OK"

[Killed] BooleanLiteral
dominio/reserva/servicio/servicio-eliminar-reserva.ts:16:13
 
     private async validarExistenciaReserva(id: number){
         const existe = await this._daoReserva.existeReservaPorId(id);
-        if (!existe) {
+        if (existe) {
             throw new ErrorDeNegocio(
                 'No se encuentra la reserva registrada'
killedBy: Pruebas al controlador de reservas deberia fallar al eliminar una reserva que no existe
statusReason: Error: expected 400 "Bad Request", got 200 "OK"
