[Killed] BlockStatement
dominio/reserva/servicio/servicio-registrar-reserva.ts:11:52
     constructor(private _repositorioReserva: RepositorioReserva, 
                 private _daoReserva: DaoReserva) {}
 
-    async ejecutar(reserva: Reserva, horas: number){
-        reserva.fechaFin = this.sumarHoras(reserva.fechaInicio, horas);
-        await this.existeReservaFuncion(reserva.fechaInicio, reserva.fechaFin);
-        await this._repositorioReserva.guardar(reserva);
-    }
+    async ejecutar(reserva: Reserva, horas: number){}
 
     private sumarHoras(fechaInicio: Date, horas: number): Date {
killedBy: Pruebas al controlador de reservas debería fallar al registar una reseva ya existente
statusReason: Error: expected 400 "Bad Request", got 201 "Created"

[Survived] BlockStatement
dominio/reserva/servicio/servicio-registrar-reserva.ts:17:64
         await this._repositorioReserva.guardar(reserva);
     }
 
-    private sumarHoras(fechaInicio: Date, horas: number): Date {
-        const fechaMoment = moment(fechaInicio);
-        fechaMoment.add(horas, 'hours');
-        fechaMoment.subtract(1, 'seconds');
-        return fechaMoment.toDate();
-    }
+    private sumarHoras(fechaInicio: Date, horas: number): Date {}
 
     private async existeReservaFuncion(_fechaInicio: Date, _fechaFin: Date) {

[Survived] StringLiteral
dominio/reserva/servicio/servicio-registrar-reserva.ts:20:33
     private sumarHoras(fechaInicio: Date, horas: number): Date {
         const fechaMoment = moment(fechaInicio);
         fechaMoment.add(horas, 'hours');
-        fechaMoment.subtract(1, 'seconds');
+        fechaMoment.subtract(1, "");
         return fechaMoment.toDate();
     }

[Killed] BlockStatement
dominio/reserva/servicio/servicio-registrar-reserva.ts:24:77
         return fechaMoment.toDate();
     }
 
-    private async existeReservaFuncion(_fechaInicio: Date, _fechaFin: Date) {
-        const existe = await this._daoReserva.existeReserva(_fechaInicio, _fechaFin);
-        if(existe){
-            throw new ErrorDeNegocio(
-                'La fecha que selecciono ya se encuentra reservada'
-            )
-        }
-    }
+    private async existeReservaFuncion(_fechaInicio: Date, _fechaFin: Date) {}
 }
killedBy: Pruebas al controlador de reservas debería fallar al registar una reseva ya existente
statusReason: Error: expected 400 "Bad Request", got 201 "Created"

[Killed] ConditionalExpression
dominio/reserva/servicio/servicio-registrar-reserva.ts:26:12
 
     private async existeReservaFuncion(_fechaInicio: Date, _fechaFin: Date) {
         const existe = await this._daoReserva.existeReserva(_fechaInicio, _fechaFin);
-        if(existe){
+        if(true){
             throw new ErrorDeNegocio(
                 'La fecha que selecciono ya se encuentra reservada'
killedBy: ServicioRegistrarReserva si la reserva no existe, guarda el Reserva en el repositorio
statusReason: ErrorDeNegocio: La fecha que selecciono ya se encuentra reservada

[Killed] BlockStatement
dominio/reserva/servicio/servicio-registrar-reserva.ts:26:19
 
     private async existeReservaFuncion(_fechaInicio: Date, _fechaFin: Date) {
         const existe = await this._daoReserva.existeReserva(_fechaInicio, _fechaFin);
-        if(existe){
-            throw new ErrorDeNegocio(
-                'La fecha que selecciono ya se encuentra reservada'
-            )
-        }
+        if(existe){}
     }
 }
killedBy: Pruebas al controlador de reservas debería fallar al registar una reseva ya existente
statusReason: Error: expected 400 "Bad Request", got 201 "Created"

[Killed] StringLiteral
dominio/reserva/servicio/servicio-registrar-reserva.ts:28:17
         const existe = await this._daoReserva.existeReserva(_fechaInicio, _fechaFin);
         if(existe){
             throw new ErrorDeNegocio(
-                'La fecha que selecciono ya se encuentra reservada'
+                ""
             )
         }
killedBy: Pruebas al controlador de reservas debería fallar al registar una reseva ya existente
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "La fecha que selecciono ya se encuentra reservada"
Received: ""
