[Killed] BlockStatement
dominio/usuario/modelo/usuario.ts:9:69
   readonly #clave: string;
   readonly #fechaCreacion: Date;
 
-  constructor(nombre: string, clave: string, fechaCreacion: string) {
-    this.validarTamanoClave(clave);
-    this.#nombre = nombre;
-    this.#clave = clave;
-    this.#fechaCreacion = new Date(fechaCreacion);
-  }
+  constructor(nombre: string, clave: string, fechaCreacion: string) {}
 
   private validarTamanoClave(clave: string) {
killedBy: Pruebas al controlador de usuarios debería fallar al registar un usuario clave muy corta
statusReason: Error: expected 400 "Bad Request", got 201 "Created"

[Killed] BlockStatement
dominio/usuario/modelo/usuario.ts:16:45
     this.#fechaCreacion = new Date(fechaCreacion);
   }
 
-  private validarTamanoClave(clave: string) {
-    if (clave.length < NUMERO_MINIMO_CARACTERES_CLAVE) {
-      throw new ErrorLongitudInvalida(
-        `El tamaño mínimo de la clave debe ser ${NUMERO_MINIMO_CARACTERES_CLAVE}`,
-      );
-    }
-  }
+  private validarTamanoClave(clave: string) {}
 
   get nombre(): string {
killedBy: Pruebas al controlador de usuarios debería fallar al registar un usuario clave muy corta
statusReason: Error: expected 400 "Bad Request", got 201 "Created"

[Killed] EqualityOperator
dominio/usuario/modelo/usuario.ts:17:9
   }
 
   private validarTamanoClave(clave: string) {
-    if (clave.length < NUMERO_MINIMO_CARACTERES_CLAVE) {
+    if (clave.length >= NUMERO_MINIMO_CARACTERES_CLAVE) {
       throw new ErrorLongitudInvalida(
         `El tamaño mínimo de la clave debe ser ${NUMERO_MINIMO_CARACTERES_CLAVE}`,
killedBy: Pruebas al controlador de usuarios debería fallar al registar un usuario clave muy corta
statusReason: Error: expected 400 "Bad Request", got 201 "Created"

[Killed] EqualityOperator
dominio/usuario/modelo/usuario.ts:17:9
   }
 
   private validarTamanoClave(clave: string) {
-    if (clave.length < NUMERO_MINIMO_CARACTERES_CLAVE) {
+    if (clave.length <= NUMERO_MINIMO_CARACTERES_CLAVE) {
       throw new ErrorLongitudInvalida(
         `El tamaño mínimo de la clave debe ser ${NUMERO_MINIMO_CARACTERES_CLAVE}`,
killedBy: Pruebas al controlador de usuarios debería fallar al registar un usuario ya existente
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "El nombre de usuario Lorem ipsum ya existe"
Received: "El tamaño mínimo de la clave debe ser 4"

[Killed] BlockStatement
dominio/usuario/modelo/usuario.ts:28:23
     return this.#nombre;
   }
 
-  get clave(): string {
-    return this.#clave;
-  }
+  get clave(): string {}
 
   get fechaCreacion(): Date {
killedBy: Usuario usuario con clave igual a 4 debería crear bien
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "4123"
Received: undefined

[Survived] BlockStatement
dominio/usuario/modelo/usuario.ts:32:29
     return this.#clave;
   }
 
-  get fechaCreacion(): Date {
-    return this.#fechaCreacion;
-  }
+  get fechaCreacion(): Date {}
 }
 
