[Killed] BlockStatement
dominio/usuario/servicio/servicio-registrar-usuario.ts:10:36
   constructor(private readonly _repositorioUsuario: RepositorioUsuario) {
   }
 
-  async ejecutar(usuario: Usuario) {
-    if (await this._repositorioUsuario.existeNombreUsuario(usuario.nombre)) {
-      throw new ErrorDeNegocio(
-        `El nombre de usuario ${usuario.nombre} ya existe`,
-      );
-    }
-    await this._repositorioUsuario.guardar(usuario);
-  }
+  async ejecutar(usuario: Usuario) {}
 }
 
killedBy: Pruebas al controlador de usuarios debería fallar al registar un usuario ya existente
statusReason: Error: expected 400 "Bad Request", got 201 "Created"

[Killed] ConditionalExpression
dominio/usuario/servicio/servicio-registrar-usuario.ts:11:9
   }
 
   async ejecutar(usuario: Usuario) {
-    if (await this._repositorioUsuario.existeNombreUsuario(usuario.nombre)) {
+    if (false) {
       throw new ErrorDeNegocio(
         `El nombre de usuario ${usuario.nombre} ya existe`,
killedBy: Pruebas al controlador de usuarios debería fallar al registar un usuario ya existente
statusReason: Error: expected 400 "Bad Request", got 201 "Created"

[Killed] BlockStatement
dominio/usuario/servicio/servicio-registrar-usuario.ts:11:77
   }
 
   async ejecutar(usuario: Usuario) {
-    if (await this._repositorioUsuario.existeNombreUsuario(usuario.nombre)) {
-      throw new ErrorDeNegocio(
-        `El nombre de usuario ${usuario.nombre} ya existe`,
-      );
-    }
+    if (await this._repositorioUsuario.existeNombreUsuario(usuario.nombre)) {}
     await this._repositorioUsuario.guardar(usuario);
   }
killedBy: ServicioRegistrarUsuario si el nombre de usuario ya existe no se puede crear y deberia retonar error
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] StringLiteral
dominio/usuario/servicio/servicio-registrar-usuario.ts:13:9
   async ejecutar(usuario: Usuario) {
     if (await this._repositorioUsuario.existeNombreUsuario(usuario.nombre)) {
       throw new ErrorDeNegocio(
-        `El nombre de usuario ${usuario.nombre} ya existe`,
+        ``,
       );
     }
killedBy: Pruebas al controlador de usuarios debería fallar al registar un usuario ya existente
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "El nombre de usuario Lorem ipsum ya existe"
Received: ""
