[Survived] BlockStatement
cliente/adaptador/dao/dao-cliente-mysql.ts:17:41
     private readonly entityManager: EntityManager,
   ) {}
 
-  async listar(): Promise<ClienteDto[]> {
-    return this.entityManager.query(
-      'SELECT c.* FROM CLIENTE c',
-    );
-  }
+  async listar(): Promise<ClienteDto[]> {}
 
   async consultarCliente(_cedula: string): Promise<ClienteEntidad> {

[Survived] StringLiteral
cliente/adaptador/dao/dao-cliente-mysql.ts:19:7
 
   async listar(): Promise<ClienteDto[]> {
     return this.entityManager.query(
-      'SELECT c.* FROM CLIENTE c',
+      "",
     );
   }

[Survived] BlockStatement
cliente/adaptador/dao/dao-cliente-mysql.ts:23:68
     );
   }
 
-  async consultarCliente(_cedula: string): Promise<ClienteEntidad> {
-    const cliente = await this.entityManager.findOne(ClienteEntidad, { where: { cedula: _cedula } });
-    return plainToClass(ClienteEntidad, cliente);
-  }
+  async consultarCliente(_cedula: string): Promise<ClienteEntidad> {}
 
   async existeCliente(_cedula: string): Promise<Boolean> {

[Survived] ObjectLiteral
cliente/adaptador/dao/dao-cliente-mysql.ts:24:79
   }
 
   async consultarCliente(_cedula: string): Promise<ClienteEntidad> {
-    const cliente = await this.entityManager.findOne(ClienteEntidad, { where: { cedula: _cedula } });
+    const cliente = await this.entityManager.findOne(ClienteEntidad, { where: {} });
     return plainToClass(ClienteEntidad, cliente);
   }

[Survived] ObjectLiteral
cliente/adaptador/dao/dao-cliente-mysql.ts:24:70
   }
 
   async consultarCliente(_cedula: string): Promise<ClienteEntidad> {
-    const cliente = await this.entityManager.findOne(ClienteEntidad, { where: { cedula: _cedula } });
+    const cliente = await this.entityManager.findOne(ClienteEntidad, {});
     return plainToClass(ClienteEntidad, cliente);
   }

[Survived] BlockStatement
cliente/adaptador/dao/dao-cliente-mysql.ts:28:58
     return plainToClass(ClienteEntidad, cliente);
   }
 
-  async existeCliente(_cedula: string): Promise<Boolean> {
-    const contarClientes = await this.entityManager.count(ClienteEntidad, { where: { cedula: _cedula } });
-    return contarClientes > 0;
-  }
+  async existeCliente(_cedula: string): Promise<Boolean> {}
 }
 

[Survived] ObjectLiteral
cliente/adaptador/dao/dao-cliente-mysql.ts:29:75
   }
 
   async existeCliente(_cedula: string): Promise<Boolean> {
-    const contarClientes = await this.entityManager.count(ClienteEntidad, { where: { cedula: _cedula } });
+    const contarClientes = await this.entityManager.count(ClienteEntidad, {});
     return contarClientes > 0;
   }

[Survived] ConditionalExpression
cliente/adaptador/dao/dao-cliente-mysql.ts:30:12
 
   async existeCliente(_cedula: string): Promise<Boolean> {
     const contarClientes = await this.entityManager.count(ClienteEntidad, { where: { cedula: _cedula } });
-    return contarClientes > 0;
+    return true;
   }
 }

[Survived] ConditionalExpression
cliente/adaptador/dao/dao-cliente-mysql.ts:30:12
 
   async existeCliente(_cedula: string): Promise<Boolean> {
     const contarClientes = await this.entityManager.count(ClienteEntidad, { where: { cedula: _cedula } });
-    return contarClientes > 0;
+    return false;
   }
 }
