[Survived] BlockStatement
cliente/adaptador/repositorio/repositorio-cliente-mysql.ts:18:59
         private readonly entityManager: EntityManager
     ) {}
 
-    async actualizar(cliente: Cliente, idCliente: number) {
-        await this.entityManager.query(
-            `UPDATE CLIENTE
-            SET nombre = ?, 
-            apellidos = ?,
-            telefono = ?, 
-            email = ?
-            WHERE id = ?`,
-            [cliente.nombre, cliente.apellidos, cliente.telefono, cliente.email, idCliente]
-        )
-    }
+    async actualizar(cliente: Cliente, idCliente: number) {}
 
     async guardar(cliente: Cliente) {

[Survived] StringLiteral
cliente/adaptador/repositorio/repositorio-cliente-mysql.ts:20:13
 
     async actualizar(cliente: Cliente, idCliente: number) {
         await this.entityManager.query(
-            `UPDATE CLIENTE
-            SET nombre = ?, 
-            apellidos = ?,
-            telefono = ?, 
-            email = ?
-            WHERE id = ?`,
+            ``,
             [cliente.nombre, cliente.apellidos, cliente.telefono, cliente.email, idCliente]
         )

[Survived] BlockStatement
cliente/adaptador/repositorio/repositorio-cliente-mysql.ts:30:37
         )
     }
 
-    async guardar(cliente: Cliente) {
-        const entidad = new ClienteEntidad();
-        entidad.cedula = cliente.cedula;
-        entidad.nombre = cliente.nombre;
-        entidad.apellidos = cliente.apellidos;
-        entidad.telefono = cliente.telefono;
-        entidad.email = cliente.email;
-        await this.repositorio.save(entidad);
-    }
+    async guardar(cliente: Cliente) {}
 }
