[Killed] BlockStatement
infraestructura/cliente/controlador/cliente.controlador.ts:18:75
 
     @Post()
     @UsePipes(new ValidationPipe({ transform: true }))
-    async crear(@Body() comandoRegistrarCliente: ComandoRegistrarCliente) {
-        await this._manejadorRegistrarCliente.ejecutar(comandoRegistrarCliente);
-    }
+    async crear(@Body() comandoRegistrarCliente: ComandoRegistrarCliente) {}
 
     @Get()
killedBy: Pruebas al controlador de clientes deberia fallar si la cedula es menor de 6 caracteres o mayor a 10
statusReason: Error: expected 400 "Bad Request", got 201 "Created"

[Killed] BlockStatement
infraestructura/cliente/controlador/cliente.controlador.ts:23:42
     }
 
     @Get()
-    async listar(): Promise<ClienteDto[]>{
-        return this._manejadorListarCliente.ejecutar();
-    }
+    async listar(): Promise<ClienteDto[]>{}
 
     @Put('/:idCliente')
killedBy: Pruebas al controlador de clientes deberia listar los clientes registrados
statusReason: Error: expected [
  {
    id: 1,
    cedula: '1234567',
    nombre: 'Juanito',
    apellidos: 'Alvarez',
    telefono: '3215548787',
    email: 'juan.1@gmail.com'

[Killed] BlockStatement
infraestructura/cliente/controlador/cliente.controlador.ts:28:119
     }
 
     @Put('/:idCliente')
-    async actualizar(@Body() comandoRegistrarCliente: ComandoRegistrarCliente, @Param('idCliente') idCliente: number) {
-        await this._manjadorActualizarCliente.ejecutar(comandoRegistrarCliente, idCliente);
-    }
+    async actualizar(@Body() comandoRegistrarCliente: ComandoRegistrarCliente, @Param('idCliente') idCliente: number) {}
 }
killedBy: Pruebas al controlador de clientes deberia fallar al intentar actualizar un cliente que no existe
statusReason: Error: expected 400 "Bad Request", got 200 "OK"
