[Survived] BlockStatement
infraestructura/cliente/entidad/cliente.entidad.ts:27:27
     @OneToMany(() => ReservaEntidad, (reserva) => reserva.cliente)
     reservas: ReservaEntidad[];
 
-    set setId(id: number) {
-        this.id = id;
-    }
+    set setId(id: number) {}
 }
