[Killed] BlockStatement
cliente/proveedor/servicio/servicio-actualizar-cliente-proveedor.ts:5:115
 import { RepositorioCliente } from "src/dominio/cliente/puerto/repositorio/repositorio-cliente";
 import { ServicioActualizarCliente } from "src/dominio/cliente/servicio/servicio-actualizar-cliente";
 
-export function servicioActualizarClienteProveedor(repositorioCliente: RepositorioCliente, daoCliente: DaoCliente){
-    return new ServicioActualizarCliente(repositorioCliente, daoCliente);
-}
+export function servicioActualizarClienteProveedor(repositorioCliente: RepositorioCliente, daoCliente: DaoCliente){}
killedBy: Pruebas al controlador de clientes deberia fallar al intentar actualizar un cliente que no existe
statusReason: Error: expected 400 "Bad Request", got 500 "Internal Server Error"
