[Killed] BlockStatement
cliente/proveedor/servicio/servicio-registrar-cliente.proveedor.ts:4:90
 import { RepositorioCliente } from "src/dominio/cliente/puerto/repositorio/repositorio-cliente";
 import { ServicioRegistrarCliente } from "src/dominio/cliente/servicio/servicio-registrar-cliente";
 
-export function servicioRegistrarClienteProveedor(repositorioCliente: RepositorioCliente){
-    return new ServicioRegistrarCliente(repositorioCliente);
-}
+export function servicioRegistrarClienteProveedor(repositorioCliente: RepositorioCliente){}
killedBy: Pruebas al controlador de clientes deberia fallar si la cedula es menor de 6 caracteres o mayor a 10
statusReason: Error: expected 400 "Bad Request", got 500 "Internal Server Error"
