[Survived] BlockStatement
src/infraestructura/configuracion/ceiba-logger.service.ts:6:36
 @Injectable({scope: Scope.TRANSIENT})
 export class AppLogger extends Logger {
 
-  public customError(error: Error) {
-    super.error(`${error.name}: ${error.message}.`,error.stack, this.context);
-  }
+  public customError(error: Error) {}
 
 }
