[Survived] ArrowFunction
src/infraestructura/configuracion/database.config.ts:4:38
 import { ConfigService } from '@nestjs/config';
 import { EnvVariables } from './environment/env-variables.enum';
 
-export const databaseConfigFactory = (configService: ConfigService) => ({
-  type: configService.get(EnvVariables.DATABASE_TYPE),
-  host: configService.get(EnvVariables.DATABASE_HOST),
-  port: configService.get(EnvVariables.DATABASE_PORT),
-  username: configService.get(EnvVariables.DATABASE_USER),
-  password: configService.get(EnvVariables.DATABASE_PASSWORD),
-  database: configService.get(EnvVariables.DATABASE_NAME),
-  entities: [configService.get(EnvVariables.TYPEORM_ENTITIES_DIR)],
-  synchronize: false,
-  migrationsTableName: configService.get(EnvVariables.TYPEORM_MIGRATIONS_TABLENAME),
-  migrations: [configService.get(EnvVariables.TYPEORM_MIGRATIONS_DIR)],
-  cli: {
-    migrationsDir: configService.get(EnvVariables.TYPEORMCLI_MIGRATIONS_DIR),
-  },
-});
+export const databaseConfigFactory = () => undefined;
 

[Survived] BooleanLiteral
src/infraestructura/configuracion/database.config.ts:12:16
   password: configService.get(EnvVariables.DATABASE_PASSWORD),
   database: configService.get(EnvVariables.DATABASE_NAME),
   entities: [configService.get(EnvVariables.TYPEORM_ENTITIES_DIR)],
-  synchronize: false,
+  synchronize: true,
   migrationsTableName: configService.get(EnvVariables.TYPEORM_MIGRATIONS_TABLENAME),
   migrations: [configService.get(EnvVariables.TYPEORM_MIGRATIONS_DIR)],
