[Timeout] BlockStatement
src/infraestructura/excepciones/filtro-excepciones-negocio.ts:14:53
 
   }
 
-  catch(error: ErrorDeNegocio, host: ArgumentsHost) {
-    const ctx = host.switchToHttp();
-    const response = ctx.getResponse<Response>();
-    const request = ctx.getRequest<Request>();
-
-    const statusCode = HttpStatus.BAD_REQUEST;
-
-    const message: Message = {
-      statusCode,
-      timestamp: new Date().toISOString(),
-      path: request.url,
-      message: error.message,
-    };
-
-    this.logger.customError(error);
-    response.status(statusCode).json(message);
-  }
+  catch(error: ErrorDeNegocio, host: ArgumentsHost) {}
 }
 
