[Survived] BlockStatement
src/infraestructura/migraciones/1583873676081-MigracionUsuario.ts:11:63
     }
 
-    public async down(queryRunner: QueryRunner): Promise<any> {
-        await queryRunner.query("DROP TABLE `USUARIO`", undefined);
-    }
+    public async down(queryRunner: QueryRunner): Promise<any> {}
 
 }
