[Survived] BlockStatement
reserva/adaptador/dao/dao-reserva-mysql.ts:14:43
     private readonly entityManager: EntityManager,
     ) {}
 
-    async listar(): Promise<ReservaDto[]> {
-        return this.entityManager.query(
-            'SELECT r.* FROM RESERVA r',
-        );
-    }
+    async listar(): Promise<ReservaDto[]> {}
 
     async existeReserva(_fechaInicio: Date, _fechaFin: Date): Promise<Boolean> {

[Survived] BlockStatement
reserva/adaptador/dao/dao-reserva-mysql.ts:20:80
         );
     }
 
-    async existeReserva(_fechaInicio: Date, _fechaFin: Date): Promise<Boolean> {
-        const resultado = await this.entityManager.query(
-            `SELECT COUNT(*)
-            FROM RESERVA
-            WHERE ? BETWEEN fechaInicio AND fechaFin
-            OR ? BETWEEN fechaInicio AND fechaFin`,
-            [_fechaInicio, _fechaFin]
-        )
-        const count = parseInt(resultado[0]['COUNT(*)']);
-        return count > 0;
-    }
+    async existeReserva(_fechaInicio: Date, _fechaFin: Date): Promise<Boolean> {}
 
     async existeReservaPorId(id: number): Promise<Boolean> {

[Survived] ConditionalExpression
reserva/adaptador/dao/dao-reserva-mysql.ts:29:16
             [_fechaInicio, _fechaFin]
         )
         const count = parseInt(resultado[0]['COUNT(*)']);
-        return count > 0;
+        return false;
     }
 

[Survived] ConditionalExpression
reserva/adaptador/dao/dao-reserva-mysql.ts:29:16
             [_fechaInicio, _fechaFin]
         )
         const count = parseInt(resultado[0]['COUNT(*)']);
-        return count > 0;
+        return true;
     }
 

[Survived] BlockStatement
reserva/adaptador/dao/dao-reserva-mysql.ts:32:60
         return count > 0;
     }
 
-    async existeReservaPorId(id: number): Promise<Boolean> {
-        const resultado = await this.entityManager.query(
-            `SELECT COUNT(*)
-            FROM RESERVA
-            WHERE id = ?`,
-            [id]
-        )
-        const count = parseInt(resultado[0]['COUNT(*)']);
-        return count > 0;
-    }
+    async existeReservaPorId(id: number): Promise<Boolean> {}
 }

[Survived] StringLiteral
reserva/adaptador/dao/dao-reserva-mysql.ts:34:13
 
     async existeReservaPorId(id: number): Promise<Boolean> {
         const resultado = await this.entityManager.query(
-            `SELECT COUNT(*)
-            FROM RESERVA
-            WHERE id = ?`,
+            ``,
             [id]
         )

[Survived] StringLiteral
reserva/adaptador/dao/dao-reserva-mysql.ts:39:45
             WHERE id = ?`,
             [id]
         )
-        const count = parseInt(resultado[0]['COUNT(*)']);
+        const count = parseInt(resultado[0][""]);
         return count > 0;
     }
