[Survived] BlockStatement
reserva/adaptador/repositorio/repositorio-reserva-mysql.ts:16:36
         private readonly entityManager: EntityManager
     ) {}
 
-    async guardar(reserva: Reserva){
-        const idCliente = (await this.daoCliente.consultarCliente(reserva.cliente.cedula)).id;
-        await this.entityManager.query("INSERT INTO RESERVA (fechaInicio, fechaFin, clienteId) VALUES (?, ?, ?)", 
-                                [reserva.fechaInicio, reserva.fechaFin, idCliente]);
-    }
+    async guardar(reserva: Reserva){}
 
     async eliminar(id: number) {

[Survived] BlockStatement
reserva/adaptador/repositorio/repositorio-reserva-mysql.ts:22:32
                                 [reserva.fechaInicio, reserva.fechaFin, idCliente]);
     }
 
-    async eliminar(id: number) {
-        await this.entityManager.query("DELETE FROM RESERVA WHERE id = ?", [id]);
-    }
+    async eliminar(id: number) {}
 }

[Survived] ArrayDeclaration
reserva/adaptador/repositorio/repositorio-reserva-mysql.ts:23:76
     }
 
     async eliminar(id: number) {
-        await this.entityManager.query("DELETE FROM RESERVA WHERE id = ?", [id]);
+        await this.entityManager.query("DELETE FROM RESERVA WHERE id = ?", []);
     }
 }
