[Killed] BlockStatement
infraestructura/reserva/controlador/reserva.controlador.ts:16:106
     
     @Post('/:horas')
     @UsePipes(new ValidationPipe({ transform: true }))
-    async crear(@Body() comandoRegistrarReserva: ComandoRegistrarReserva, @Param('horas') horas: number) {
-        await this._manejadorRegistrarReserva.ejecutar(comandoRegistrarReserva, horas);
-    }
+    async crear(@Body() comandoRegistrarReserva: ComandoRegistrarReserva, @Param('horas') horas: number) {}
 
     @Get()
killedBy: Pruebas al controlador de reservas debería fallar al registar una reseva ya existente
statusReason: Error: expected 400 "Bad Request", got 201 "Created"

[Killed] BlockStatement
infraestructura/reserva/controlador/reserva.controlador.ts:21:42
     }
 
     @Get()
-    async listar(): Promise<ReservaDto[]>{
-        return this._manejadorListarReserva.ejecutar();
-    }
+    async listar(): Promise<ReservaDto[]>{}
 
     @Delete(':id')
killedBy: Pruebas al controlador de reservas debería listar las reservas registradas
statusReason: Error: expected [
  {
    fechaInicio: '2023-07-12T13:57:26.117Z',
    fechaFin: '2023-07-12T13:57:26.117Z',
    cliente: {
      cedula: '1234567',
      nombre: 'Juan',
      apellidos: 'Perez',

[Killed] BlockStatement
infraestructura/reserva/controlador/reserva.controlador.ts:26:45
     }
 
     @Delete(':id')
-    async eliminar(@Param('id') id: number) {
-        await this._manejadorEliminarReserva.ejecutar(id);
-    }
+    async eliminar(@Param('id') id: number) {}
 }
killedBy: Pruebas al controlador de reservas deberia fallar al eliminar una reserva que no existe
statusReason: Error: expected 400 "Bad Request", got 200 "OK"
