[Survived] ObjectLiteral
reserva/proveedor/dao/dao-reserva.proveedor.ts:4:35
 import { DaoReserva } from "src/dominio/reserva/puerto/dao/dao-reserva";
 import { DaoReservaMysql } from "../../adaptador/dao/dao-reserva-mysql";
 
-export const daoReservaProvider = {
-    provide: DaoReserva,
-    useClass: DaoReservaMysql
-}
+export const daoReservaProvider = {}
