[Killed] BlockStatement
reserva/proveedor/servicio/servicio-eliminar-reserva.proveedor.ts:5:114
 import { RepositorioReserva } from "src/dominio/reserva/puerto/repositorio/repositorio-reserva";
 import { ServicioEliminarReserva } from "src/dominio/reserva/servicio/servicio-eliminar-reserva";
 
-export function servicioEliminarReservaProveedor(repositorioReserva: RepositorioReserva, daoReserva: DaoReserva) {
-    return new ServicioEliminarReserva(repositorioReserva, daoReserva);
-}
+export function servicioEliminarReservaProveedor(repositorioReserva: RepositorioReserva, daoReserva: DaoReserva) {}
killedBy: Pruebas al controlador de reservas deberia fallar al eliminar una reserva que no existe
statusReason: Error: expected 400 "Bad Request", got 500 "Internal Server Error"
