[Killed] BlockStatement
reserva/proveedor/servicio/servicio-registrar-reserva.proveedor.ts:5:115
 import { RepositorioReserva } from "src/dominio/reserva/puerto/repositorio/repositorio-reserva";
 import { ServicioRegistrarReserva } from "src/dominio/reserva/servicio/servicio-registrar-reserva";
 
-export function servicioRegistrarReservaProveedor(repositorioReserva: RepositorioReserva, daoReserva: DaoReserva) {
-    return new ServicioRegistrarReserva(repositorioReserva, daoReserva);
-}
+export function servicioRegistrarReservaProveedor(repositorioReserva: RepositorioReserva, daoReserva: DaoReserva) {}
killedBy: Pruebas al controlador de reservas debería fallar al registar una reseva ya existente
statusReason: Error: expected 400 "Bad Request", got 500 "Internal Server Error"
