[Survived] BlockStatement
usuario/adaptador/dao/dao-usuario-mysql.ts:14:41
     private readonly entityManager: EntityManager,
   ) {}
 
-  async listar(): Promise<UsuarioDto[]> {
-    return this.entityManager.query(
-      'SELECT u.nombre, u.fechaCreacion FROM USUARIO u',
-    );
-  }
+  async listar(): Promise<UsuarioDto[]> {}
 }
 
