[Survived] BlockStatement
usuario/adaptador/repositorio/repositorio-usuario-mysql.ts:15:63
     private readonly repositorio: Repository<UsuarioEntidad>,
   ) {}
 
-  async existeNombreUsuario(nombre: string): Promise<boolean> {
-    return (await this.repositorio.count({ nombre })) > 0;
-  }
+  async existeNombreUsuario(nombre: string): Promise<boolean> {}
 
   async guardar(usuario: Usuario) {

[Survived] ConditionalExpression
usuario/adaptador/repositorio/repositorio-usuario-mysql.ts:16:12
   ) {}
 
   async existeNombreUsuario(nombre: string): Promise<boolean> {
-    return (await this.repositorio.count({ nombre })) > 0;
+    return false;
   }
 

[Survived] ConditionalExpression
usuario/adaptador/repositorio/repositorio-usuario-mysql.ts:16:12
   ) {}
 
   async existeNombreUsuario(nombre: string): Promise<boolean> {
-    return (await this.repositorio.count({ nombre })) > 0;
+    return true;
   }
 

[Survived] BlockStatement
usuario/adaptador/repositorio/repositorio-usuario-mysql.ts:19:35
     return (await this.repositorio.count({ nombre })) > 0;
   }
 
-  async guardar(usuario: Usuario) {
-    const entidad = new UsuarioEntidad();
-    entidad.clave = usuario.clave;
-    entidad.fechaCreacion = usuario.fechaCreacion;
-    entidad.nombre = usuario.nombre;
-    await this.repositorio.save(entidad);
-  }
+  async guardar(usuario: Usuario) {}
 }
 
