[Killed] BlockStatement
infraestructura/usuario/controlador/usuario.controlador.ts:16:73
 
   @Post()
   @UsePipes(new ValidationPipe({ transform: true }))
-  async crear(@Body() comandoRegistrarUsuario: ComandoRegistrarUsuario) {
-    await this._manejadorRegistrarUsuario.ejecutar(comandoRegistrarUsuario);
-  }
+  async crear(@Body() comandoRegistrarUsuario: ComandoRegistrarUsuario) {}
 
   @Get()
killedBy: Pruebas al controlador de usuarios debería fallar al registar un usuario clave muy corta
statusReason: Error: expected 400 "Bad Request", got 201 "Created"

[Killed] BlockStatement
infraestructura/usuario/controlador/usuario.controlador.ts:21:41
   }
 
   @Get()
-  async listar(): Promise<UsuarioDto[]> {
-    return this._manejadorListarUsuario.ejecutar();
-  }
+  async listar(): Promise<UsuarioDto[]> {}
 }
 
killedBy: Pruebas al controlador de usuarios debería listar los usuarios registrados
statusReason: Error: expected [
  { nombre: 'Lorem ipsum', fechaCreacion: '2023-07-12T13:58:00.320Z' }
] response body, got {}
