[Killed] BlockStatement
usuario/proveedor/servicio/servicio-registrar-usuario.proveedor.ts:4:91
 import { RepositorioUsuario } from 'src/dominio/usuario/puerto/repositorio/repositorio-usuario';
 import { ServicioRegistrarUsuario } from 'src/dominio/usuario/servicio/servicio-registrar-usuario';
 
-export function servicioRegistrarUsuarioProveedor(repositorioUsuario: RepositorioUsuario) {
-  return new ServicioRegistrarUsuario(repositorioUsuario);
-}
+export function servicioRegistrarUsuarioProveedor(repositorioUsuario: RepositorioUsuario) {}
 
killedBy: Pruebas al controlador de usuarios debería fallar al registar un usuario clave muy corta
statusReason: Error: expected 400 "Bad Request", got 500 "Internal Server Error"
